from app import create_app, db
from services.job_filters import Specialty

app = create_app()

majors = [
    "محاسبة", "هندسة", "مالية", "موارد بشرية", "تأمين", "تسويق", "إقتصاد",
    "علوم سياسية", "نظم المعلومات الإدارية", "إدارة أعمال", "إدارة البيع و التجزئة",
    "إدارة سلسلة الإمداد", "هندسة البرمجيات", "هندسة تطبيقية", "هندسة مدنية",
    "هندسة معمارية", "هندسة صناعية", "هندسة كهربائية", "هندسة ميكانيكية",
    "هندسة الطيران والفضاء", "هندسة التعدين", "هندسة نووية", "هندسة بيئية",
    "هندسة كميائية", "هندسة حرارية", "هندسة الإنتاج", "هندسة البرتول", "علوم الحاسب",
    "نظم معلومات", "الإعلان و الإتصال التسويقي", "إدارة الإعلانات", "تصميم إبتكاري",
    "النقل المائي - البحرية", "الدراسات الإسلامية", "تربية فنية", "خدمة مجتمعية",
    "التاريخ", "الجغرافيا", "علم المعلومات", "إعلام", "مصمم جرافيك", "علم نفس",
    "الفيزياء", "الكيمياء", "الرياضيات", "الأحياء", "علم الفلك", "الإحصاء", "الطب",
    "الصيدلة", "طب الأسنان", "التمريض", "العلاج الطبيعي", "سياحة", "اللغة العربية",
    "قانون عام", "قانون خاص", "أخرى"
]

with app.app_context():
    # Only create the new table
    Specialty.__table__.create(db.engine, checkfirst=True)
    
    for major in majors:
        if not Specialty.query.filter_by(name_ar=major).first():
            db.session.add(Specialty(name_ar=major))
    
    db.session.commit()
    print("Specialties seeded!")
